## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=7pU9Uw]
data.terraform_remote_state.main: Read complete after 0s
google_service_account.app: Refreshing state... [id=projects/onix-lnd/serviceAccounts/skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_vertex_ai_reasoning_engine.session_and_memory: Refreshing state... [id=projects/onix-lnd/locations/us-central1/reasoningEngines/7588436729258835968]
google_storage_bucket.artifact_service: Refreshing state... [id=skill-agent-lnd-dev-artifact-service-ee953d53]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=onix-lnd/roles/storage.objectUser/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=onix-lnd/roles/cloudtrace.agent/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=onix-lnd/roles/storage.bucketViewer/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=onix-lnd/roles/logging.logWriter/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=onix-lnd/roles/aiplatform.user/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=onix-lnd/roles/telemetry.tracesWriter/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=onix-lnd/roles/serviceusage.serviceUsageConsumer/serviceAccount:skill-agent-lnd-dev@onix-lnd.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/onix-lnd/locations/us-central1/services/skill-agent-lnd-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_cloud_run_v2_service.app["us-central1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_cloud_run_v2_service" "app" {
      + annotations             = (known after apply)
      + binary_authorization    = (known after apply)
      + build_config            = (known after apply)
      + client                  = (known after apply)
      + client_version          = (known after apply)
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + custom_audiences        = (known after apply)
      + default_uri_disabled    = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = (known after apply)
      + description             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + iap_enabled             = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = (known after apply)
      + labels                  = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + multi_region_settings   = (known after apply)
      + name                    = "skill-agent-lnd-dev"
      + observed_generation     = (known after apply)
      + reconciling             = (known after apply)
      + scaling                 = (known after apply)
      + template                = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic                 = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)
    }

  # google_cloud_run_v2_service.app["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/onix-lnd/locations/us-central1/services/skill-agent-lnd-dev"
        name                    = "skill-agent-lnd-dev"
        # (35 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "us-central1-docker.pkg.dev/onix-lnd/skill-agent-lnd-dev/skill-agent-lnd@sha256:ee314998db7500dd92ef107fc2ff0d74d33318c24dc0a9a77fef3515515cbd1e" -> "us-central1-docker.pkg.dev/onix-lnd/skill-agent-lnd-dev/skill-agent-lnd@sha256:6025b9f40040a88a9511ea3bf9ba200f3aa96249bfc16c94187813075584b788"
                name           = null
                # (6 unchanged attributes hidden)

                # (17 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_run_services               = {
      ~ us-central1 = {
          ~ latest_ready_revision = "skill-agent-lnd-dev-00002-jp2" -> (known after apply)
          ~ update_time           = "2026-02-23T11:16:17.118021Z" -> (known after apply)
          ~ uri                   = "https://skill-agent-lnd-dev-p2ftnrxyha-uc.a.run.app" -> (known after apply)
        }
    }
  ~ deployed_image                   = "us-central1-docker.pkg.dev/onix-lnd/skill-agent-lnd-dev/skill-agent-lnd@sha256:ee314998db7500dd92ef107fc2ff0d74d33318c24dc0a9a77fef3515515cbd1e" -> "us-central1-docker.pkg.dev/onix-lnd/skill-agent-lnd-dev/skill-agent-lnd@sha256:6025b9f40040a88a9511ea3bf9ba200f3aa96249bfc16c94187813075584b788"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---